# tap
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "leoafarias/fvm"

# tools / libraries
brew "asdf"
brew "cocoapods"
brew "coreutils"
brew "curl"
brew "fd" # Simple, fast and user-friendly alternative to find
brew "git"
brew "openjdk@11"
brew "stow"
brew "starship"
brew "mas" # Mac App Store command-line interface
brew "ripgrep" # Search tool like grep and The Silver Searfcher
brew "tree" # Display directories as trees (with optional color/HTML output)
brew "leoafarias/fvm/fvm"
brew "postgresql@15"

cask "google-cloud-sdk"

# editor
brew "neovim"

# gui
cask "android-studio"
cask "cleanmymac"
cask "cleanshot"
cask "discord"
cask "docker"
cask "figma"
cask "fork"
cask "google-chrome"
cask "inkscape"
cask "kindle"
cask "krita"
cask "maccy"
cask "notion"
cask "pgadmin4"
cask "slack"
cask "tableplus"
cask "visual-studio-code"
cask "zoom"

# languages
brew "go"

# fonts
cask "font-hack-nerd-font"
cask "font-ricty-diminished"

# mas
mas "BetterSnapTool", id: 417375580
mas "Bitwarden", id: 1352778147
mas "LINE", id: 539883307
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
