tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "leoafarias/fvm"
tap "michaeleisel/zld" # Fast linker for Rust. See https://bevyengine.org/learn/book/getting-started/setup/
brew "asdf"
brew "cmake" # Cross-platform make(Used by Aseprite)
brew "cocoapods"
brew "fd" # Simple, fast and user-friendly alternative to find
brew "go"
brew "jq" # Lightweight and flexible command-line JSON processor(Used by Aseprite)
brew "mas" # Mac App Store command-line interface
brew "ninja" # Small build system for use with gyp or CMake(Used by Aseprite)
brew "openjdk@11"
brew "postgresql@15"
brew "ripgrep" # Search tool like grep and The Silver Searcher
brew "rust-analyzer"
brew "starship"
brew "stow"
brew "tree" # Display directories as trees (with optional color/HTML output)
brew "leoafarias/fvm/fvm"
brew "michaeleisel/zld/zld" # Fast linker for Rust. See https://bevyengine.org/learn/book/getting-started/setup/
cask "affinity-designer"
cask "android-studio"
cask "audacity"
cask "blender"
cask "cleanmymac"
cask "cleanshot"
cask "figma"
cask "font-hack-nerd-font"
cask "font-ricty-diminished"
cask "fork"
cask "google-chrome"
cask "google-cloud-sdk"
cask "inkscape"
cask "iterm2"
cask "karabiner-elements"
cask "krita"
cask "mono-mdk" # For Unity
cask "notion"
cask "pgadmin4"
cask "raycast"
cask "slack"
cask "steam"
cask "unity-hub"
cask "visual-studio-code"
cask "zoom"
mas "Bitwarden", id: 1352778147
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
